# MismatchedSystemTypeWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..MismatchedSystemTypeWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The selected fixture is part of a different system. You may want to edit the system type and merge two systems.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchedSystemTypeWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchedSystemTypeWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchedSystemTypeWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace